import june1 from "../assets/images/1June.jpg";
import june1_2 from "../assets/images/1June-2.jpg";
import june1_3 from "../assets/images/1June-3.jpg";

import list0 from "../assets/images/studentRegister/list0.png";
import list1  from "../assets/images/studentRegister/list1.png";
import list2  from "../assets/images/studentRegister/list2.png";

export const allNews = [
  {
    id: 1,
    title: "កម្មវិធីទិវាកុមារអន្តរជាតិ ១ មិថុនា ២០២៦",
    category: "ការអប់រំ",
    date: "១ មិថុនា ២០២៦",
    author: "ម៉ាន់ វាសនា",

    coverImage: june1,

    gallery: [
      june1,
      june1_2,
      june1_3,
    ],

    content: `
ព័ត៌មានផ្លូវការ៖ វិទ្យាល័យចំណេះទូទៅ និងបច្ចេកទេស ព្រះបាទសម្ដេចព្រះបរមនាថ នរោត្តម សីហមុនី រៀបចំពិធីអបអរសាទរទិវាកុមារអន្តរជាតិ ១ មិថុនា

[កំពង់ត្រឡាច] — នៅថ្ងៃចន្ទ ១រោច ខែជេស្ឋ ឆ្នាំममี អដ្ឋស័ក ព.ស.២៥៧០ ត្រូវនឹងថ្ងៃទី០១ ខែមិថុនា ឆ្នាំ២០២៦ វិទ្យាល័យចំណេះទូទៅ និងបច្ចេកទេស ព្រះបាទសម្ដេចព្រះបរមនាថ នរោត្តម សីហមុនី បានរៀបចំពិធីអបអរសាទរ «ទិវាកុមារអន្តរជាតិ ១ មិថុនា លើកទី៧៧» យ៉ាងគគ្រឹកគគ្រេង។

ពិធីដ៏មានអត្ថន័យនេះ បានប្រព្រឹត្តទៅក្រោមអធិបតីភាពដ៏ខ្ពង់ខ្ពស់របស់ លោក អាំ សុគុន្ធ អភិបាលរងនៃគណៈអភិបាលស្រុកកំពង់ត្រឡាច។

ខ្លឹមសារគន្លឹះនៃកម្មវិធី៖
ក្នុងឱកាសដ៏ថ្លៃថ្លានោះ លោកអភិបាលរងស្រុក ដែលជាគណៈអធិបតី បានថ្លែងអំណរកោតសរសើរ និងផ្ដាំផ្ញើសារយ៉ាងស៊ីជម្រៅ ដោយបានលើកឡើងអំពី៖
- ការការពារ និងថែរក្សា៖ យកចិត្តទុកដាក់ខ្ពស់លើសុវត្ថិភាព និងសុខុមាលភាពរបស់កុមារគ្រប់រូប។
- ការលើកកម្ពស់សិទ្ធិកុមារ៖ ធានាឱ្យកុមារទទួលបានសិទ្ធិមូលដ្ឋានពេញលេញ ជាពិសេសគឺសិទ្ធិទទួលបានការអប់រំ សេវាសុខភាព និងការអភិវឌ្ឍសមត្ថភាពប្រកបដោយគុណភាព ដើម្បីក្លាយជាទំពាំងស្នងឫស្សីដ៏រឹងមាំរបស់ជាតិ។

បរិយាកាសនៃពិធី៖
កម្មវិធីទាំងមូលបានប្រព្រឹត្តទៅក្នុងបរិយាកាសដ៏ស្និទ្ធស្នាល សប្បាយរីករាយ និងពោរពេញដោយស្នាមញញឹម ក្រោមការចូលរួមយ៉ាងកុះករពីសំណាក់៖
- លោកនាយក លោកស្រីនាយិការង លោកគ្រូ អ្នកគ្រូ
- ប្អូនៗសិស្សានុសិស្សានុសិស្សយ៉ាងច្រើនកុះករ
- ព្រមទាំងតំណាងអាជ្ញាធរមូលដ្ឋាន សហគមន៍ និងអ្នកពាក់ព័ន្ធនានា។

«វិនិយោគលើកុមារនៅថ្ងៃនេះ គឺជាការកសាងអនាគតដ៏រុងរឿងរបស់ប្រទេសជាតិនៅថ្ងៃស្អែក»
`,
  },  
  {
    id: 7,
    title: "បញ្ជីឈ្មោះសិស្សថ្នាក់ទី១០ ឆ្នាំសិក្សា ២០២៥-២០២៦",
    category: "ការអប់រំ",
    date: "៥ មិថុនា ២០២៦",
    author: "ម៉ាន់ វាសនា",

    coverImage: list2,

    gallery: [
      list0,
      list1,
      list2,
    ],

    content: `
ព័ត៌មានផ្លូវការ៖ បញ្ជីឈ្មោះសិស្សដែលបានចូលរៀនថ្នាក់ទី១០ ឆ្នាំសិក្សា ២០២៥-២០២៦ នៅវិទ្យាល័យចំណេះទូទៅ និងបច្ចេកទេស ព្រះបាទសម្ដេចព្រះបរមនាថ នរោត្តម សីហមុនី

សូមក្រឡេកមើលលម្អិតពេញលេញខាងក្រោម៖
`,

    webviewUrl: "https://script.google.com/macros/s/AKfycbwTIWbiUeLZmiHe7Wtb4taCtlFKotb-2EKWZW38W8biyRU7ztcQX1bStnDWSoTCFtsr/exec",
  },
];

